espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/app/bluetooth/common/app_ota_dfu/sl_bt_app_ota_dfu.c
/***************************************************************************/ /**
 * @file
 * @brief Application Over-the-Air Device Firmware Update
 *******************************************************************************
 * # License
 * <b>Copyright 2022 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/
#include <stdbool.h>
#include <stddef.h>
#include "em_common.h"
#include "sl_bluetooth.h"
#include "gatt_db.h"

#include "btl_interface.h"
#include "btl_interface_storage.h"

#include "sl_bt_app_ota_dfu.h"
#include "sli_bt_app_ota_dfu.h"

/// Possible control words of OTA control characteristic
#define SL_BT_APP_OTA_DFU_BEGIN_PROGRESS       0u
#define SL_BT_APP_OTA_DFU_END_PROGRESS         3u
#define SL_BT_APP_OTA_DFU_CLOSE_CONNECTION     4u

#define ATT_ERR_WRITE_REQUEST_REJECTED         0x80u
#define ATT_ERR_NOT_READY_FOR_WRITE_REQUEST    0x81u
#define ATT_ERR_STORAGE_FULL                   0x82u
#define ATT_ERR_PACKAGE_LOST                   0x83u

#ifndef SL_BT_INVALID_CONNECTION_HANDLE
#define SL_BT_INVALID_CONNECTION_HANDLE ((uint8_t) 0xFF)
#endif // SL_BT_INVALID_CONNECTION_HANDLE

// Bootloader storage
static BootloaderInformation_t bootloader_info;
static BootloaderStorageSlot_t slot_info;

// OTA
static uint32_t ota_conn_hdl = SL_BT_INVALID_CONNECTION_HANDLE;
static sl_bt_app_ota_dfu_status_t ota_prev_sts = SL_BT_APP_OTA_DFU_UNINIT;
static sl_bt_app_ota_dfu_status_t ota_sts = SL_BT_APP_OTA_DFU_UNINIT;
static uint32_t ota_img_pos = 0u;

static sl_bt_app_ota_dfu_status_evt_t ota_event;

static uint8_t ota_buff[BOOTLOADER_STORAGE_VERIFICATION_CONTEXT_SIZE];

/**************************************************************************/ /**
 * Weak Application OTA DFU initialization.
 *****************************************************************************/
SL_WEAK void sl_bt_app_ota_dfu_init(void)
{
  int32_t boot_retv = BOOTLOADER_OK;
  sl_bt_app_ota_dfu_error_t ota_error = SL_BT_APP_OTA_DFU_NO_ERROR;

  // Bootloader init must be called before using bootloader_* API calls!
  boot_retv = bootloader_init();
  if (boot_retv == BOOTLOADER_OK) {
    sli_bt_app_ota_dfu_set_main_status(SL_BT_APP_OTA_DFU_INIT);
  } else {
    ota_error = SL_BT_APP_OTA_DFU_ERR_BOOTLOADER_API;
    sli_bt_app_ota_dfu_set_main_status(SL_BT_APP_OTA_DFU_ERROR);
  }

  // Forward state change information to application.
  ota_event.event_id = SL_BT_APP_OTA_DFU_EVT_STATE_CHANGE_ID;
  ota_event.ota_error_code = ota_error;
  ota_event.btl_api_retval = boot_retv;
  ota_event.evt_info.sts.status = ota_sts;
  ota_event.evt_info.sts.prev_status = ota_prev_sts;
  sl_bt_app_ota_dfu_on_status_event(&ota_event);
}

/**************************************************************************/ /**
 * Internal function to set Application OTA DFU main status.
 *****************************************************************************/
void sli_bt_app_ota_dfu_set_main_status(sl_bt_app_ota_dfu_status_t new_status)
{
  ota_prev_sts = ota_sts;
  ota_sts = new_status;
  // Continue execution.
  sli_bt_app_ota_dfu_proceed();
}

/**************************************************************************/ /**
 * Event handler.
 *****************************************************************************/
void sli_bt_app_ota_dfu_on_event(sl_bt_msg_t *evt)
{
  uint8_t attr_status = SL_STATUS_OK;
  uint32_t connection;
  uint32_t characteristic;

  int32_t btl_ret_val = BOOTLOADER_OK;
  sl_bt_app_ota_dfu_error_t ota_error = SL_BT_APP_OTA_DFU_NO_ERROR;
  sl_bt_app_ota_dfu_status_t req_sts = SL_BT_APP_OTA_DFU_UNINIT;

  // Handle stack events
  switch (SL_BT_MSG_ID(evt->header)) {
    ///////////////////////////////////////////////////////////////////////////
    // OTA package write request event                                       //
    ///////////////////////////////////////////////////////////////////////////
    case sl_bt_evt_gatt_server_user_write_request_id:
      // Get characteristic and connection handle
      characteristic = evt->data.evt_gatt_server_user_write_request.characteristic;
      connection = evt->data.evt_gatt_server_user_write_request.connection;
      attr_status = SL_STATUS_OK;

      if (characteristic == gattdb_ota_control) {
        // OTA control characteristic detected.
        switch (evt->data.evt_gatt_server_user_write_request.value.data[0]) {
          case SL_BT_APP_OTA_DFU_BEGIN_PROGRESS:
            // Accept OTA begin request from single connection source, only!
            if (ota_sts == SL_BT_APP_OTA_DFU_READY
                && (ota_conn_hdl == SL_BT_INVALID_CONNECTION_HANDLE
                    || ota_conn_hdl == connection)) {
              // Application ready for the OTA DFU process.
              req_sts = SL_BT_APP_OTA_DFU_DOWNLOAD_BEGIN;
              ota_img_pos = 0;
              // save connection handle for later error checking / handling
              ota_conn_hdl = connection;
            } else {
              // Application not ready for the OTA DFU process.
              req_sts = SL_BT_APP_OTA_DFU_ERROR;
              ota_error = SL_BT_APP_OTA_DFU_ERR_UNEXPECTED_TRANSFER;
            }
            break;

