espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/app/bluetooth/common/app_ota_dfu/sl_bt_app_ota_dfu.c
          case SL_BT_APP_OTA_DFU_END_PROGRESS:
            // Wait for connection close and then reboot.
            req_sts = SL_BT_APP_OTA_DFU_DOWNLOAD_END;
            break;

          case SL_BT_APP_OTA_DFU_CLOSE_CONNECTION:
            // Requested to close connection.
            req_sts = SL_BT_APP_OTA_DFU_DISCONNECT;
            break;

          default:
            break;
        }
      } else if (characteristic == gattdb_ota_data && ota_conn_hdl == connection) {
        // OTA data characteristic detected - handle only if the connection is the initiator one.
        if (ota_sts == SL_BT_APP_OTA_DFU_DOWNLOAD_BEGIN) {
          if (ota_img_pos >= (slot_info.length)) {
            req_sts = SL_BT_APP_OTA_DFU_ERROR;
            ota_error = SL_BT_APP_OTA_DFU_ERR_STORAGE_FULL;
            attr_status = ATT_ERR_STORAGE_FULL;
          } else {
            //Additional buffer required to avoid passing unaligned data to the bootloader API.
            //The data element can be unaligned.
            memcpy(ota_buff,
                   evt->data.evt_gatt_server_user_write_request.value.data,
                   evt->data.evt_gatt_server_user_write_request.value.len);
            btl_ret_val =
              bootloader_writeStorage(SL_BT_APP_OTA_DFU_USED_SLOT,
                                      ota_img_pos,
                                      ota_buff,
                                      evt->data.evt_gatt_server_user_write_request.value.len);
            // Check write storage results
            if (btl_ret_val != BOOTLOADER_OK) {
              // Write failed.
              req_sts = SL_BT_APP_OTA_DFU_ERROR;
              ota_error = SL_BT_APP_OTA_DFU_ERR_BOOTLOADER_API;
              attr_status = ATT_ERR_PACKAGE_LOST;
            } else {
              // Stay in download state until process finished.
              req_sts = SL_BT_APP_OTA_DFU_DOWNLOAD_BEGIN;
              // Write successful. Update image position.
              ota_img_pos +=
                evt->data.evt_gatt_server_user_write_request.value.len;
              attr_status = SL_STATUS_OK;
            }
          }
        } else {
          // Unexpected download has to be aborted.
          // Application OTA not ready or error occurred during
          // ongoing download process.
          req_sts = SL_BT_APP_OTA_DFU_ERROR;
          attr_status = ATT_ERR_NOT_READY_FOR_WRITE_REQUEST;
        }
      }

      // Forward download information to application.
      ota_event.event_id = SL_BT_APP_OTA_DFU_EVT_DOWNLOAD_PACKET_ID;
      ota_event.ota_error_code = ota_error;
      ota_event.btl_api_retval = btl_ret_val;
      ota_event.evt_info.download_packet.connection_handle = connection;
      ota_event.evt_info.download_packet.write_image_position = ota_img_pos;
      sl_bt_app_ota_dfu_on_status_event(&ota_event);

      // Send write-response to GATT device.
      sl_bt_gatt_server_send_user_write_response(connection,
                                                 characteristic,
                                                 attr_status);
      // Update state if necessary.
      if (ota_sts != req_sts) {
        sli_bt_app_ota_dfu_set_main_status(req_sts);
        // Forward state change information to application.
        ota_event.event_id = SL_BT_APP_OTA_DFU_EVT_STATE_CHANGE_ID;
        ota_event.ota_error_code = ota_error;
        ota_event.btl_api_retval = btl_ret_val;
        ota_event.evt_info.sts.status = ota_sts;
        ota_event.evt_info.sts.prev_status = ota_prev_sts;
        sl_bt_app_ota_dfu_on_status_event(&ota_event);
        // Continue execution.
        sli_bt_app_ota_dfu_proceed();
      }
      break;

    ///////////////////////////////////////////////////////////////////////////
    // Bluetooth connection closed event                                     //
    ///////////////////////////////////////////////////////////////////////////
    case sl_bt_evt_connection_closed_id:
      connection = evt->data.evt_connection_closed.connection;

      // Ignore all close events other than the connection that did the update.
      if (ota_conn_hdl == connection) {
        if (ota_sts == SL_BT_APP_OTA_DFU_DOWNLOAD_END) {
          // Only If the download finished successfully, the image verification
          // will start automatically.

          // Set verify state - may be reverted if verify init fails below.
          req_sts = SL_BT_APP_OTA_DFU_VERIFY;
          sli_bt_app_ota_dfu_set_main_status(req_sts);

          // Try to prepare for verification.
          btl_ret_val = bootloader_initVerifyImage(SL_BT_APP_OTA_DFU_USED_SLOT,
                                                   ota_buff,
                                                   sizeof(ota_buff));
          if (btl_ret_val != BOOTLOADER_OK) {
            // Verification init failed.
            req_sts = SL_BT_APP_OTA_DFU_ERROR;
            ota_error = SL_BT_APP_OTA_DFU_ERR_BOOTLOADER_API;
          } else {
            // Reuse image position to store verification position.
            ota_img_pos = 0u;
            ota_event.ota_error_code = SL_BT_APP_OTA_DFU_NO_ERROR;
          }
        } else if (ota_sts == SL_BT_APP_OTA_DFU_DOWNLOAD_BEGIN) {
          // Connection should not be closed during an update!
          req_sts = SL_BT_APP_OTA_DFU_ERROR;
          ota_event.ota_error_code = SL_BT_APP_OTA_DFU_ERR_UNEXPECTED_CLOSE;
        } else {
          // Restart handler just in case.
          req_sts = SL_BT_APP_OTA_DFU_INIT;
          ota_event.ota_error_code = SL_BT_APP_OTA_DFU_NO_ERROR;
        }

        // Don't call status update again if verify init was already successful.
        if (ota_sts != req_sts) {
          sli_bt_app_ota_dfu_set_main_status(req_sts);
        }

        // Forward state change information to application, always.
        ota_event.event_id = SL_BT_APP_OTA_DFU_EVT_STATE_CHANGE_ID;
        ota_event.btl_api_retval = btl_ret_val;
        ota_event.evt_info.sts.status = ota_sts;
        ota_event.evt_info.sts.prev_status = ota_prev_sts;
        sl_bt_app_ota_dfu_on_status_event(&ota_event);
        // Forget the OTA connection handle
        ota_conn_hdl = SL_BT_INVALID_CONNECTION_HANDLE;
        // Continue execution.
        sli_bt_app_ota_dfu_proceed();
      }
      break;

    default:
      break;
  }
}

/**************************************************************************/ /**
 * Function to check if it is okay if the device goes to sleep now.
 *****************************************************************************/
bool sl_bt_app_ota_dfu_is_ok_to_sleep(void)
{
  bool ret_val = true;
  // Device shall go to sleep if:
  // - no verification is in progress
  // - no storage checking for erase is in progress
  if ((ota_sts == SL_BT_APP_OTA_DFU_VERIFY) \
      || (ota_sts == SL_BT_APP_OTA_DFU_ERASE)) {
    ret_val = false;
  }
  return ret_val;
}

/**************************************************************************//**
 * Routine to notify power manager handler.
 *****************************************************************************/
sl_power_manager_on_isr_exit_t sl_bt_app_ota_dfu_sleep_on_isr_exit(void)
{
  sl_power_manager_on_isr_exit_t ret_val = SL_POWER_MANAGER_IGNORE;
  // Device shall wake up for sure if:
  // - verification is in progress
  // - storage checking for erase is in progress
  if ((ota_sts == SL_BT_APP_OTA_DFU_VERIFY) \
      || (ota_sts == SL_BT_APP_OTA_DFU_ERASE)) {
    ret_val = SL_POWER_MANAGER_WAKEUP;
  }
  return ret_val;
}

/**************************************************************************//**
 * Weak function to proceed cyclic action in case of xRTOS kernel projects.
 *****************************************************************************/
SL_WEAK void sli_bt_app_ota_dfu_proceed(void)
{
  ///////////////////////////////////////////////////////////////////////////
  // Let the cyclic process executed, in case of xRTOS scheduling.         //
  // This is to avoid unwanted power-consumption when the application OTA  //
  // cyclic process not required, e.g. application awaits for user action. //
  ///////////////////////////////////////////////////////////////////////////
}

/**************************************************************************/ /**
 * Cyclic process of Application OTA DFU.
 *****************************************************************************/
void sli_bt_app_ota_dfu_step(void)
{
  int32_t btl_ret_val = BOOTLOADER_OK;
  sl_bt_app_ota_dfu_error_t ota_error = SL_BT_APP_OTA_DFU_NO_ERROR;
  sl_bt_app_ota_dfu_status_t req_sts = SL_BT_APP_OTA_DFU_UNINIT;

