espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/app/bluetooth/common/app_ota_dfu/sl_bt_app_ota_dfu.c
  uint32_t offset = 0, num_blocks = 0, i = 0;
  bool dirty = false;

  switch (ota_sts) {
    ///////////////////////////////////////////////////////////////////////////
    // Pre initialization state.                                             //
    ///////////////////////////////////////////////////////////////////////////
    case SL_BT_APP_OTA_DFU_UNINIT:
      // Intentionally left blank.
      break;

    ///////////////////////////////////////////////////////////////////////////
    // Bootloader API initialized, check storage content.                    //
    ///////////////////////////////////////////////////////////////////////////
    case SL_BT_APP_OTA_DFU_INIT:
      // Get bootloader information.
      bootloader_getInfo(&bootloader_info);
      // Get storage slot information.
      btl_ret_val =
        bootloader_getStorageSlotInfo(SL_BT_APP_OTA_DFU_USED_SLOT, &slot_info);

      if (btl_ret_val == BOOTLOADER_OK) {
        // Forward bootloader and storage information to application.
        ota_event.event_id = SL_BT_APP_OTA_DFU_EVT_BTL_STORAGE_INFO_ID;
        ota_event.ota_error_code = SL_BT_APP_OTA_DFU_NO_ERROR;
        ota_event.btl_api_retval = btl_ret_val;
        ota_event.evt_info.btl_storage.bootloader_type = bootloader_info.type;
        ota_event.evt_info.btl_storage.bootloader_ver = bootloader_info.version;
        ota_event.evt_info.btl_storage.storage_size_bytes = slot_info.length;
        ota_event.evt_info.btl_storage.storage_start_addr = slot_info.address;
        sl_bt_app_ota_dfu_on_status_event(&ota_event);
        // Proceed to erase state to erase the storage.
        req_sts = SL_BT_APP_OTA_DFU_ERASE;
      } else {
        // Getting bootloader and storage information failed.
        req_sts = SL_BT_APP_OTA_DFU_ERROR;
        ota_error = SL_BT_APP_OTA_DFU_ERR_BOOTLOADER_API;
      }
      // Change to next state.
      sli_bt_app_ota_dfu_set_main_status(req_sts);
      // Forward state change information to application.
      ota_event.event_id = SL_BT_APP_OTA_DFU_EVT_STATE_CHANGE_ID;
      ota_event.ota_error_code = ota_error;
      ota_event.btl_api_retval = btl_ret_val;
      ota_event.evt_info.sts.status = ota_sts;
      ota_event.evt_info.sts.prev_status = ota_prev_sts;
      sl_bt_app_ota_dfu_on_status_event(&ota_event);
      // Continue execution.
      sli_bt_app_ota_dfu_proceed();
      break;
    ///////////////////////////////////////////////////////////////////////////
    // Erase storage slot if neccessary.                                     //
    ///////////////////////////////////////////////////////////////////////////
    case SL_BT_APP_OTA_DFU_ERASE:
      // Check the download area content by reading it in byte blocks.
      num_blocks = slot_info.length / SL_BT_APP_OTA_DFU_READ_STORAGE_CONTEXT_SIZE;
      // Run through the full storage and read the context in chunks.
      while ((dirty == false) && (offset < SL_BT_APP_OTA_DFU_READ_STORAGE_CONTEXT_SIZE * num_blocks) && (btl_ret_val == BOOTLOADER_OK)) {
        // Actual storage content read.
        btl_ret_val =
          bootloader_readStorage(SL_BT_APP_OTA_DFU_USED_SLOT,
                                 offset,
                                 ota_buff,
                                 SL_BT_APP_OTA_DFU_READ_STORAGE_CONTEXT_SIZE);

        if (btl_ret_val == BOOTLOADER_OK) {
          // Run through the chunk byte-by-byte and check if its empty or not.
          for (i = 0; i < SL_BT_APP_OTA_DFU_READ_STORAGE_CONTEXT_SIZE && !dirty; i++) {
            if (ota_buff[i] != SL_BT_APP_OTA_DFU_EMPTY_FLASH_CONTENT) {
              dirty = true;
            }
          }
          // Proceed with next data chunk.
          offset += SL_BT_APP_OTA_DFU_READ_STORAGE_CONTEXT_SIZE;
        }
      }
      // Check results.
      if (btl_ret_val != BOOTLOADER_OK) {
        // Bootloader API issue during reading flash content.
        ota_error = SL_BT_APP_OTA_DFU_ERR_BOOTLOADER_API;
        req_sts = SL_BT_APP_OTA_DFU_ERROR;
      } else if (dirty) {
        // Storage space is not empty proceed to erase.
        btl_ret_val = bootloader_eraseStorageSlot(SL_BT_APP_OTA_DFU_USED_SLOT);
        if (btl_ret_val != BOOTLOADER_OK) {
          // Failed to erase storage slot.
          ota_error = SL_BT_APP_OTA_DFU_ERR_BOOTLOADER_API;
          req_sts = SL_BT_APP_OTA_DFU_ERROR;
        } else {
          // Storage slot erased successfully.
          // Application OTA DFU component is ready for an OTA process.
          req_sts = SL_BT_APP_OTA_DFU_READY;
        }
      } else {
        // Storage space was originally empty, proceed to next
        req_sts = SL_BT_APP_OTA_DFU_READY;
      }
      // Change to next state.
      sli_bt_app_ota_dfu_set_main_status(req_sts);
      // Forward state change information to application.
      ota_event.event_id = SL_BT_APP_OTA_DFU_EVT_STATE_CHANGE_ID;
      ota_event.ota_error_code = ota_error;
      ota_event.btl_api_retval = btl_ret_val;
      ota_event.evt_info.sts.status = ota_sts;
      ota_event.evt_info.sts.prev_status = ota_prev_sts;
      sl_bt_app_ota_dfu_on_status_event(&ota_event);
      // Continue execution.
      sli_bt_app_ota_dfu_proceed();
      break;
    ///////////////////////////////////////////////////////////////////////////
    // Ready for OTA DFU process.                                            //
    ///////////////////////////////////////////////////////////////////////////
    case SL_BT_APP_OTA_DFU_READY:
      // In ready state the usual business can happen on the application side.
      break;

    ///////////////////////////////////////////////////////////////////////////
    // Disconnected state.                                                   //
    ///////////////////////////////////////////////////////////////////////////
    case SL_BT_APP_OTA_DFU_DISCONNECT:
      // Intentionally left blank.
      break;

    ///////////////////////////////////////////////////////////////////////////
    // Download started state.                                               //
    ///////////////////////////////////////////////////////////////////////////
    case SL_BT_APP_OTA_DFU_DOWNLOAD_BEGIN:
      // Covered in the event handler.
      break;

    ///////////////////////////////////////////////////////////////////////////
    // Download finished state.                                               //
    ///////////////////////////////////////////////////////////////////////////
    case SL_BT_APP_OTA_DFU_DOWNLOAD_END:
      // Covered in the event handler.
      break;

    ///////////////////////////////////////////////////////////////////////////
    // Verify downloaded image.                                              //
    ///////////////////////////////////////////////////////////////////////////
    case SL_BT_APP_OTA_DFU_VERIFY:
      // Verify downloaded bytes of the image.
      btl_ret_val = bootloader_continueVerifyImage(ota_buff, NULL);
      if (btl_ret_val == BOOTLOADER_ERROR_PARSE_CONTINUE) {
        // Verification may continue.
        ota_img_pos += SL_BT_APP_OTA_DFU_VERIFICATION_BLOCK_SIZE;
        // Avoid state change in this case.
        req_sts = ota_sts;
      } else if (btl_ret_val == BOOTLOADER_ERROR_PARSE_SUCCESS) {
        // Last chunk of bytes checked.
        ota_img_pos += SL_BT_APP_OTA_DFU_VERIFICATION_BLOCK_SIZE;
        // Verification finished successfully.
        // This means state change as well.
        req_sts = SL_BT_APP_OTA_DFU_FINALIZE;
        ota_error = SL_BT_APP_OTA_DFU_NO_ERROR;
      } else {
        // Verification process aborted.
        req_sts = SL_BT_APP_OTA_DFU_ERROR;
        ota_error = SL_BT_APP_OTA_DFU_ERR_BOOTLOADER_API;
      }

      // Update mandatory event fields anyways.
      ota_event.event_id = SL_BT_APP_OTA_DFU_EVT_VERIFY_IMAGE_ID;
      ota_event.ota_error_code = ota_error;
      ota_event.btl_api_retval = btl_ret_val;
      // Forward verification status to application.
      ota_event.evt_info.verified_bytes = ota_img_pos;
      sl_bt_app_ota_dfu_on_status_event(&ota_event);

      if (ota_sts != req_sts) {
        // State change is also necessary because
        // error occured or verification finished successfully.
        sli_bt_app_ota_dfu_set_main_status(req_sts);
        ota_event.event_id = SL_BT_APP_OTA_DFU_EVT_STATE_CHANGE_ID;
        ota_event.evt_info.sts.status = req_sts;
        ota_event.evt_info.sts.prev_status = ota_prev_sts;
        sl_bt_app_ota_dfu_on_status_event(&ota_event);
      }
      // Continue execution.
      sli_bt_app_ota_dfu_proceed();
      break;

    ///////////////////////////////////////////////////////////////////////////
    // Finalize Application OTA DFU process and reboot.                      //
    ///////////////////////////////////////////////////////////////////////////
    case SL_BT_APP_OTA_DFU_FINALIZE:
      // Set image for next boot.
      btl_ret_val = bootloader_setImageToBootload(SL_BT_APP_OTA_DFU_USED_SLOT);
      if (btl_ret_val != BOOTLOADER_OK) {
        // Setting Image to boot failed.
        req_sts = SL_BT_APP_OTA_DFU_ERROR;
        ota_error = SL_BT_APP_OTA_DFU_ERR_BOOTLOADER_API;
      } else {
        // Get ready for reboot trigger from user code.
        req_sts = SL_BT_APP_OTA_DFU_WAIT_FOR_REBOOT;
      }
      // Change to next state.
      sli_bt_app_ota_dfu_set_main_status(req_sts);
      // Forward state change information to application.
      ota_event.event_id = SL_BT_APP_OTA_DFU_EVT_STATE_CHANGE_ID;
      ota_event.ota_error_code = ota_error;
      ota_event.btl_api_retval = btl_ret_val;
      ota_event.evt_info.sts.status = ota_sts;
      ota_event.evt_info.sts.prev_status = ota_prev_sts;
      sl_bt_app_ota_dfu_on_status_event(&ota_event);
      break;

    ///////////////////////////////////////////////////////////////////////////
    // Wait for reboot triggering state.                                     //
    ///////////////////////////////////////////////////////////////////////////
    case SL_BT_APP_OTA_DFU_WAIT_FOR_REBOOT:
      // Intentionally left blank.
      break;

    ///////////////////////////////////////////////////////////////////////////
    // Error state.                                                          //
    ///////////////////////////////////////////////////////////////////////////
    case SL_BT_APP_OTA_DFU_ERROR:
      // In error state the device awaits for application intervention.
      break;
  }
}

/**************************************************************************/ /**
 * Weak function to restart application OTA DFU progress without rebooting in
 * case of any error.
 *****************************************************************************/
SL_WEAK void sl_bt_app_ota_dfu_restart_progress(void)
{
  // Re-run init function.
  sl_bt_app_ota_dfu_init();
}

/**************************************************************************/ /**
 * Function to reboot only when the application OTA DFU process finished
 * completely.
 *****************************************************************************/
void sl_bt_app_ota_dfu_reboot(void)
{
  if (ota_sts == SL_BT_APP_OTA_DFU_WAIT_FOR_REBOOT) {
    bootloader_rebootAndInstall();
  }
}

/**************************************************************************/ /**
 * Weak function to indicate Application OTA DFU status and in case of error
 * the error codes for assertion.
 * @param[in] evt Actual app ota dfu event.
 * @note To be implemented in user code.
 *****************************************************************************/
SL_WEAK void sl_bt_app_ota_dfu_on_status_event(sl_bt_app_ota_dfu_status_evt_t *evt)
{
  // Default error handling: trying to recover.
  if (evt->evt_info.sts.status == SL_BT_APP_OTA_DFU_ERROR) {
    // Restart the system, install the image.
    sl_bt_app_ota_dfu_restart_progress();
  } else if (evt->evt_info.sts.status == SL_BT_APP_OTA_DFU_WAIT_FOR_REBOOT) {
    // Default finish action: auto-reboot.
    sl_bt_app_ota_dfu_reboot();
  }
}
